zsh/zshrc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-09 Wed 15:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My zsh configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marcus Crane" />
</head>
<body>
<div id="content">
<h1 class="title">My zsh configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org05a0321">1. Setting up PATHs</a>
<ul>
<li><a href="#orgf83cf57">1.1. Universal system folders</a></li>
</ul>
</li>
<li><a href="#orgfeb96be">2. Initialisation</a>
<ul>
<li><a href="#org64e2746">2.1. Determining the current OS</a></li>
<li><a href="#orgff5da9d">2.2. Setting my workspace</a></li>
<li><a href="#orgaf1e906">2.3. Setting various global constants</a></li>
<li><a href="#org3025e11">2.4. Setting some Windows / WSL specific constants</a></li>
</ul>
</li>
<li><a href="#org2ec4352">3. Applications</a>
<ul>
<li><a href="#orgd992339">3.1. asdf</a></li>
<li><a href="#orge0668e3">3.2. Dropbox</a></li>
<li><a href="#orge4c8c00">3.3. Emacs</a></li>
<li><a href="#orgfb81da9">3.4. Erlang</a></li>
<li><a href="#org8f700d6">3.5. git</a></li>
<li><a href="#orgf7494b7">3.6. go</a></li>
<li><a href="#orga9aaf1c">3.7. Homebrew</a></li>
<li><a href="#org6e72bb6">3.8. nix</a></li>
<li><a href="#org05c7c47">3.9. Python</a></li>
<li><a href="#orgb9c01ff">3.10. Rust</a></li>
<li><a href="#org04ac563">3.11. Work setup</a></li>
</ul>
</li>
<li><a href="#orgf4ef37b">4. Shortcuts</a></li>
<li><a href="#org536e625">5. Functions</a></li>
</ul>
</div>
</div>
<p>
Welcome to my configuration. It&rsquo;s always a work in progress.
</p>

<div id="outline-container-org05a0321" class="outline-2">
<h2 id="org05a0321"><span class="section-number-2">1</span> Setting up PATHs</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf83cf57" class="outline-3">
<h3 id="orgf83cf57"><span class="section-number-3">1.1</span> Universal system folders</h3>
<div class="outline-text-3" id="text-1-1">
<p>
These paths generally exist on most every system so we&rsquo;ll set them seperately from other PATH additions.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"/bin:/sbin:/usr/bin:/usr/sbin:/usr/local/bin:/usr/local/sbin:/opt/X11/bin:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfeb96be" class="outline-2">
<h2 id="orgfeb96be"><span class="section-number-2">2</span> Initialisation</h2>
<div class="outline-text-2" id="text-2">
<p>
This section consists of helpers functions and global variables used by various applications.
</p>

<p>
A few of the helper functions are intended to make sure my configuration acts mostly identical across all machines and OSes without any extra configuration.
</p>

<p>
Whether that statement holds true is&#x2026; debatable :)
</p>
</div>

<div id="outline-container-org64e2746" class="outline-3">
<h3 id="org64e2746"><span class="section-number-3">2.1</span> Determining the current OS</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In order to save having to remember how to use <code>uname</code> and all that, I just have my own little configuration within my shell that I can reference
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #98be65;">(</span>uname -r<span style="color: #98be65;">)</span> =~ <span style="color: #98be65;">'microsoft'</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">OPSYS</span>=<span style="color: #98be65;">"windows"</span>
<span style="color: #51afef;">else</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">OPSYS</span>=$<span style="color: #51afef;">{</span><span style="color: #c678dd;">(</span>L<span style="color: #c678dd;">)</span>$<span style="color: #c678dd;">(</span>uname -s<span style="color: #c678dd;">)</span><span style="color: #51afef;">}</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>

<p>
Windows is a bit of a misnomer here because what I&rsquo;m really checking for is whether the shell is running inside of <a href="https://docs.microsoft.com/en-us/windows/wsl/about">Windows Subsystem for Linux (WSL)</a>
</p>

<p>
Functionally, I can treat WSL and Linux the same (and I do) but there are some minor alterations I make use of, such as pointing the <code>DISPLAY</code> environment variable at an X display server on my host system
</p>

<p>
It&rsquo;s worth noting that the value of <code>$OPSYS</code> on <code>macOS</code> is <code>darwin</code>. I could change it to be clearer but <a href="https://en.wikipedia.org/wiki/Darwin_(operating_system)">Darwin</a> is technically the correct name for the base operating system
</p>
</div>
</div>

<div id="outline-container-orgff5da9d" class="outline-3">
<h3 id="orgff5da9d"><span class="section-number-3">2.2</span> Setting my workspace</h3>
<div class="outline-text-3" id="text-2-2">
<p>
All of my development occurs in <code>$HOME/Code</code> regardless of what machine I&rsquo;m on. One day I might change it though hence the variable.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">WORKSPACE</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">HOME</span><span style="color: #98be65;">/Code"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf1e906" class="outline-3">
<h3 id="orgaf1e906"><span class="section-number-3">2.3</span> Setting various global constants</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">CONFIG_FILE</span>=<span style="color: #98be65;">"~/.zshrc"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">CONFIG_SRC</span>=<span style="color: #98be65;">"~/dotfiles/zsh/zshrc.org"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">EDITOR</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(command -v emacs)</span><span style="color: #98be65;">client -c"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">GPG_TTY</span>=$<span style="color: #51afef;">(</span>tty<span style="color: #51afef;">)</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">LANGUAGE</span>=<span style="color: #98be65;">"en_NZ:en"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PROMPT</span>=<span style="color: #98be65;">'%B%F{green}&gt;%f%b '</span>
</pre>
</div>

<ol class="org-ol">
<li><p>
In some cases, when I compile Emacs, I&rsquo;m not able to find the <code>emacsclient</code> executiable within my path.
</p>

<p>
This doesn&rsquo;t really make much sense given <code>emacs</code> and <code>emacsclient</code> tend to live side by side and I don&rsquo;t actually remember the specific details from last time I ran into that problem.
</p>

<p>
In the event that happens anyway, this quick hack (find <code>emacs</code> and append &ldquo;client&rdquo; on the end) works in the meantime
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org3025e11" class="outline-3">
<h3 id="org3025e11"><span class="section-number-3">2.4</span> Setting some Windows / WSL specific constants</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #dcaeea;">OPSYS</span> == <span style="color: #98be65;">"windows"</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">DISPLAY</span>=$<span style="color: #51afef;">(</span><span style="color: #ECBE7B;">cat</span> /etc/resolv.conf | <span style="color: #ECBE7B;">grep</span> nameserver | awk <span style="color: #98be65;">'{print $2; exit;}'</span><span style="color: #51afef;">)</span>:0.0
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">BROWSER</span>=<span style="color: #98be65;">"/mnt/c/Windows/explorer.exe"</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>

<ol class="org-ol">
<li>If I&rsquo;m running on a Windows machine, I run Emacs by starting a daemon inside my terminal and connecting with <code>emacsclient</code>. Doing so spawns a new frame using the X display server running on the Windows host itself</li>

<li>While I don&rsquo;t believe this actually works, I attempt to override the <code>BROWSER</code> environment variable to open links on the Windows host from within Emacs</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2ec4352" class="outline-2">
<h2 id="org2ec4352"><span class="section-number-2">3</span> Applications</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd992339" class="outline-3">
<h3 id="orgd992339"><span class="section-number-3">3.1</span> asdf</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The version manager to rule them all
</p>

<p>
It wraps a number of existing language version managers into plugins that can be managed through one unified CLI tool
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">ASDF_DIR</span>=$<span style="color: #dcaeea;">HOME</span>/.asdf
. $<span style="color: #dcaeea;">ASDF_DIR</span>/asdf.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0668e3" class="outline-3">
<h3 id="orge0668e3"><span class="section-number-3">3.2</span> Dropbox</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Depending on which computer I&rsquo;m using, I&rsquo;ll often have my Dropbox in different places
</p>

<p>
Historically, it would only be in a different place when using Emacs in WSL (I store my org stuff in Dropbox)
</p>

<p>
I&rsquo;m currently in the process of moving to Dropbox within WSL though, which will mean that all version of Dropbox will live in <code>$HOME/Dropbox</code>
</p>

<p>
The reason for that is because file operations across WSL boundaries (ie anything on the C:\ Drive) is super slow compared to staying within the boundaries
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">DROPBOX_DIR</span>=~/Dropbox
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4c8c00" class="outline-3">
<h3 id="orge4c8c00"><span class="section-number-3">3.3</span> Emacs</h3>
<div class="outline-text-3" id="text-3-3">
<p>
I&rsquo;ll probably configure this a fair bit more but for now, I just shorten the name of <code>emacsclient</code>
</p>

<div class="org-src-container">
<pre class="src src-bash">alias <span style="color: #dcaeea;">ec</span>=$<span style="color: #dcaeea;">EDITOR</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"~/.emacs.d/bin:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb81da9" class="outline-3">
<h3 id="orgfb81da9"><span class="section-number-3">3.4</span> Erlang</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Whenever I compile <code>erlang</code> (using <code>asdf</code>), I always use the same flags so it&rsquo;s easier to just set them within my shell
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">KERL_CONFIGURE_OPTIONS</span>=<span style="color: #98be65;">"--disable-debug --without-javac"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">KERL_BUILD_DOCS</span>=<span style="color: #98be65;">"yes"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f700d6" class="outline-3">
<h3 id="org8f700d6"><span class="section-number-3">3.5</span> git</h3>
<div class="outline-text-3" id="text-3-5">
<p>
To save me having to set up each machine, I just set my Git identifiers each time
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">git</span> config --global user.name <span style="color: #98be65;">"Marcus Crane"</span>
<span style="color: #ECBE7B;">git</span> config --global user.email <span style="color: #98be65;">"marcus@utf9k.net"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7494b7" class="outline-3">
<h3 id="orgf7494b7"><span class="section-number-3">3.6</span> go</h3>
<div class="outline-text-3" id="text-3-6">
<p>
While I don&rsquo;t write much golang, it&rsquo;s kind of annoying to set it up each time so I just leave working configuration in each of my shells in the event that I decide to do anything golang related
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">GOPATH</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">WORKSPACE</span><span style="color: #98be65;">/go"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> -a <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">ASDF_DIR</span><span style="color: #98be65;">/plugins/golang"</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">GOROOT</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(asdf where golang)</span><span style="color: #98be65;">/go"</span>
<span style="color: #51afef;">fi</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">GOPATH</span><span style="color: #98be65;">/bin:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">GOROOT</span><span style="color: #98be65;">:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9aaf1c" class="outline-3">
<h3 id="orga9aaf1c"><span class="section-number-3">3.7</span> Homebrew</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Sometimes I have trouble with rsync which is about the only thing that this snippet fixes
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #dcaeea;">OPSYS</span> == <span style="color: #98be65;">"darwin"</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"/usr/bin/local:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e72bb6" class="outline-3">
<h3 id="org6e72bb6"><span class="section-number-3">3.8</span> nix</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> -a <span style="color: #98be65;">"~/.nix-profile"</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  . ~/.nix-profile/etc/profile.d/nix.sh
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org05c7c47" class="outline-3">
<h3 id="org05c7c47"><span class="section-number-3">3.9</span> Python</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> -a $<span style="color: #98be65;">(</span>asdf where python<span style="color: #98be65;">)</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(asdf where python)</span><span style="color: #98be65;">/bin:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9c01ff" class="outline-3">
<h3 id="orgb9c01ff"><span class="section-number-3">3.10</span> Rust</h3>
<div class="outline-text-3" id="text-3-10">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> -a <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">ASDF_DIR</span><span style="color: #98be65;">/plugins/rust"</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(asdf where rust)</span><span style="color: #98be65;">/bin:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org04ac563" class="outline-3">
<h3 id="org04ac563"><span class="section-number-3">3.11</span> Work setup</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #c678dd;">[</span> -f <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">HOME</span><span style="color: #98be65;">/dotfiles/work/entrypoint.sh"</span> <span style="color: #c678dd;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  . <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">HOME</span><span style="color: #98be65;">/dotfiles/work/entrypoint.sh"</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf4ef37b" class="outline-2">
<h2 id="orgf4ef37b"><span class="section-number-2">4</span> Shortcuts</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-bash">alias <span style="color: #dcaeea;">ae</span>=<span style="color: #98be65;">"deactivate &amp;&gt; /dev/null; source ./venv/bin/activate"</span>
alias <span style="color: #dcaeea;">de</span>=<span style="color: #98be65;">"deactivate &amp;&gt; /dev/null"</span>
alias <span style="color: #dcaeea;">edit</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">EDITOR</span><span style="color: #98be65;"> </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">CONFIG_SRC</span><span style="color: #98be65;">"</span>
alias <span style="color: #dcaeea;">gb</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> branch -v"</span>
alias <span style="color: #dcaeea;">gbd</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> branch -D"</span>
alias <span style="color: #dcaeea;">gbm</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> checkout master"</span>
alias <span style="color: #dcaeea;">gcm</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> commit -Si"</span>
alias <span style="color: #dcaeea;">gpom</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> pull origin master"</span>
alias <span style="color: #dcaeea;">gpum</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> pull upstream master"</span>
alias <span style="color: #dcaeea;">gr</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> remote -v"</span>
alias <span style="color: #dcaeea;">gst</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> status"</span>
alias <span style="color: #dcaeea;">pap</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">git</span><span style="color: #98be65;"> pull upstream master &amp;&amp; </span><span style="color: #98be65;">git</span><span style="color: #98be65;"> push origin master"</span>
alias <span style="color: #dcaeea;">refresh</span>=<span style="color: #98be65;">"tangle-file </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">CONFIG_SRC</span><span style="color: #98be65;"> &amp;&gt; /dev/null &amp;&amp; stow zsh -d ~/dotfiles &amp;&amp; source </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">CONFIG_FILE</span><span style="color: #98be65;"> &amp;&amp; </span><span style="color: #98be65;">echo</span><span style="color: #98be65;"> 'Refreshed config'"</span>
alias <span style="color: #dcaeea;">venv</span>=<span style="color: #98be65;">"python3 -m virtualenv venv &amp;&amp; ae"</span>
alias <span style="color: #dcaeea;">vi</span>=<span style="color: #98be65;">"nvim"</span>
alias <span style="color: #dcaeea;">view</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">less</span><span style="color: #98be65;"> </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">CONFIG_FILE</span><span style="color: #98be65;">"</span>
alias <span style="color: #dcaeea;">vim</span>=<span style="color: #98be65;">"nvim"</span>
alias <span style="color: #dcaeea;">ws</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">cd</span><span style="color: #98be65;"> </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">WORKSPACE</span><span style="color: #98be65;">"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org536e625" class="outline-2">
<h2 id="org536e625"><span class="section-number-2">5</span> Functions</h2>
<div class="outline-text-2" id="text-5">
<p>
These are some handly one line functions I use from time to time
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef;">function</span> <span style="color: #c678dd;">whomport</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span> lsof -nP -i4TCP:$<span style="color: #da8548; font-weight: bold;">1</span> | <span style="color: #ECBE7B;">grep</span> LISTEN <span style="color: #51afef;">}</span>

<span style="color: #51afef;">function</span> <span style="color: #c678dd;">tangle-file</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  emacs --batch -l org $<span style="color: #dcaeea;">@</span> -f org-babel-tangle
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcus Crane</p>
<p class="date">Created: 2020-09-09 Wed 15:28</p>
</div>
</body>
</html>
